# HasMiter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExtension..::..HasMiter Property
IExtension Interface See Also
---
Retrieves the miter status at the end
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
bool this[
	int index
] { get; }
```

Visual Basic
---
```text
ReadOnly Property HasMiter ( _
	index As Integer _
) As Boolean
	Get
```

Visual C++
---
```text
property bool HasMiter[int index] {
	bool get (int index);
}
```

# ### Parameters
index
    Type: System..::..Int32
# Remarks
Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown. For beams, this can check whether the beam is mitered with other beams at the end
# See Also
IExtension Interface
Autodesk.Revit.DB Namespace